import React, {Component} from "react";
import img from './image.jpg'
import './article.scss'

export default class Article extends Component {

    render() {

        return <div className="article container">
            
            <div className="article__column article__column--1">
                <h1 className="article__title">Гість Номеру</h1>

                <p className="article__text">
                    ЦЕНТР ВИВЧЕННЯ ІНОЗЕМНИХ МОВ «SUCCESS» ОНТУ –
                    НАВЧАЙСЯ РАЗОМ З ПРОФЕСІОНАЛАМИ

                    Сьогодні знання іноземних мов є необхідністю. Якщо ти хочеш бути
                    мобільним, якщо ти хочеш не відчувати бар39;єрів у роботі з іноземними
                    експертами, якщо ти хочеш просто мандрувати и насолоджуватися від колориту
                    інших культу тобі не обійтися без знання хоча б однієї іноземної мови. В
                    Одеському національному технологічному університеті завжди активно
                    розвивали и продовжують розвивати вектори міжнародної співпраці. Саме тому
                    вивченню іноземних мов у нашому закладі вищої освіти завжди приділяли
                    особливу увагу. Так, на базі університету діє Центр вивчення іноземних мов
                    «Success», де можуть проходити навчання співробітники, викладачі, аспіранти,
                    студенти ОНТУ. У центрі працює висококваліфікована команда викладачів, які
                    із задоволенням подарують кожному бажаючому вивчати іноземні мови ключ до
                    успіху в сучасному світі.
                    Ольго Іванівно, розкажіть, будь ласка, які іноземні мови вивчаються у
                    Центрі вивчення іноземних мов «Success» Одеського національного
                    технологічного університету?
                    О.І.: Центр вивчення іноземних мов «Success» є навчальним структурним
                    підрозділом ОНТУ, що забезпечує отримання та удосконалення знань з
                    іноземних мов різних рівнів. Курси працюють за такими напрямами:
                    - англійська мова (для початківців);
                    - англійська мова (середній рівень навчання);
                    - англійська мова (вищий рівень навчання);
                    німецька мова, французька мова (для початківців).
                    Протягом останніх років було впроваджено спецкурси підготовки для
                    складання Єдиного вступного іспиту до магістратури та аспірантури.
                    Можете охарактеризувати команду викладачів, які навчають слухачів
                    курсів.
                    О.І.: Роботу курсів іноземних мов забезпечує кафедра української та
                    іноземної філології. Викладачі зазначеної кафедри (доцент Зінченко О.С., доцент
                    Огреніч М.А., старший викладач Шепель М.Є., викладач Безніс П.М. та ін.)
                    забезпечують високу ефективність педагогічної і науково-методичної діяльності
                    центру; мають досвід практичної роботи, постійно підвищують свій
                    професійний рівень (мають міжнародні сертифікати). Центр пишається
                    викладацьким складом, адже їхній професіоналізм, творчий підхід до своєї
                    справи допоможуть нашим слухачам досягти високих результатів.
                    Окрім того, завдяки підтримці проректора з науково-педагогічної роботи та
                    міжнародних зв’язків ОНТУ М.Р. Мардар і завідувачки кафедри української та
                    іноземної філології О.С. Зінченко Центр вивчення іноземних мов «Success» має
                    змогу проводити на університетському рівні експрес-консультації, онлайн
                    консультації з підвищення рівня володіння англійською мовою студентам,
                    викладачам і співробітникам, що дозволяє їм належним чином брати участь в

                    освітньому, науковому житті на міжнародному рівні. Написання диктанту
                    англійською мовою для всіх охочих – це вже традиційна щорічна акція нашого
                    центру.
                    - Яка методика навчання?
                    О.І.: Програми навчання на курсах ґрунтуються на Загальноєвропейських
                    рекомендаціях із мовної освіти. Для кожного рівня мовної підготовки
                    розробляємо навчальні програми. Успішність вивчення іноземної мови

                    залежить від ефективності методики навчання, тому в основі програм курсів
                </p>
            </div>
            
            <div className="article__column article__column--2">
                <img src={img} alt=""/>
            </div>
            
        </div>
    }
}