import React, {Component} from "react";
import img from './image.jpg'
import AdvertItem from "./advert-item";
import './advert.scss'

export default class Advert extends Component {

    state = {
        list: [
            {image: img, title: 'ЗВ’ЯЗКУ ЗІ ВТРАТОЮ ВВАЖАТИ НЕДІЙСНИМ ДИПЛОМ МАГІСТРА, ВИДАНИЙ ОДЕСЬКОЮ ДЕРЖАВНОЮ АКАДЕМІЄЮ ХОЛОДУ', text: ' - серія ДІ No009670 (реєстр. No70/20) від 25.06.2004 р. за спеціальністю «Комп’ютерні системи та мережі» на ім’я Фаді Закур'},
            {image: img, title: 'ЗВ’ЯЗКУ ЗІ ВТРАТОЮ ВВАЖАТИ НЕДІЙСНИМ ДИПЛОМ МАГІСТРА, ВИДАНИЙ ОДЕСЬКОЮ ДЕРЖАВНОЮ АКАДЕМІЄЮ ХОЛОДУ', text: ' - серія ДІ No009670 (реєстр. No70/20) від 25.06.2004 р. за спеціальністю «Комп’ютерні системи та мережі» на ім’я Фаді Закур'},
            {image: img, title: 'ЗВ’ЯЗКУ ЗІ ВТРАТОЮ ВВАЖАТИ НЕДІЙСНИМ ДИПЛОМ МАГІСТРА, ВИДАНИЙ ОДЕСЬКОЮ ДЕРЖАВНОЮ АКАДЕМІЄЮ ХОЛОДУ', text: ' - серія ДІ No009670 (реєстр. No70/20) від 25.06.2004 р. за спеціальністю «Комп’ютерні системи та мережі» на ім’я Фаді Закур'},
            {image: img, title: 'ЗВ’ЯЗКУ ЗІ ВТРАТОЮ ВВАЖАТИ НЕДІЙСНИМ ДИПЛОМ МАГІСТРА, ВИДАНИЙ ОДЕСЬКОЮ ДЕРЖАВНОЮ АКАДЕМІЄЮ ХОЛОДУ', text: ' - серія ДІ No009670 (реєстр. No70/20) від 25.06.2004 р. за спеціальністю «Комп’ютерні системи та мережі» на ім’я Фаді Закур'},
        ]
    }

    render() {

        return <div className="advert container">

            <h5 className="advert__title">Оголошення</h5>

            <div className="advert__wrapper">

                {this.state.list.map((item, index) => {
                    return <AdvertItem item={item} key={index} />
                })}

            </div>

        </div>
    }
}